[
    {
        "title": "Why You Should Invest in Live Fire Cooking",
        "author": "Graham Vickers",
        "job": "CEO/ Lead Editor",
        "date": "December, 7, 2021, 12:30PM EST",
        "postMonth": "december",
        "profilePic": "headshot_circle.png",
        "img": "smokin_sausage.jpg",
        "post": "Cooking with a live fire heat source is a true craft to master and can daunting to new comers, but with my help I will make it a breeze. So grab a cold beer, some quality meat and let’s get cooking I've been cooking on a live fire grill for more than 6+ years and I can confidently say that I know what I'm talking about when it comes to smoking meat on a live fire grill. I have cooked on propane grills, Big Green Eggs, Yoder Smoker, and even camp fires. I can go on for days what will make the perfect fire with like the right wood, temperature conditions, grill distance, smoke levels and so much more. So stay tuned."
    },
    {
        "title": "Top 5 Smokers and Barbecues to Have in 2021",
        "author": "Graham Vickers",
        "job": "CEO/ Lead Editor",
        "date": "August, 2, 2021, 12:00PM EST",
        "postMonth": "august",
        "profilePic": "headshot_circle.png",
        "show": "popular",
        "img": "top5.jpg",
        "post": "The Best Smoker to have this season has to be the Yoder Smokers by a land slide. The precision temperature settings and 1/4 inch cnc cut american steel makes this the ultimate smoker to have around the house, in a restaurant or even out at bbq tournaments. This thing will not let you down it's built to last a life time!"
    },
    {
        "title": "What to Buy a Grill Master for Christmas 2021!",
        "author": "Graham Vickers",
        "job": "CEO/ Lead Editor",
        "date": "December, 2, 2021, 2:00PM EST",
        "postMonth": "december",
        "profilePic": "headshot_circle.png",
        "img": "gifts.jpg",
        "show": "popular",
        "post": "If you're struggling to buy the perfect bbq accessory for a full time grill master or home cook, then you have came to the right place because I'm going to tell you my top 5 must have's this 2021/2022 bbq season. Let's begin with #5 - Welding Gloves, these are a must have for moving a plate setter or taking off a roasting pan! #4 - Spray/ Mist Bottle, this is perfect for a barbecuer's because they can keep their meat from drying out on the smoker by squirting apple juice or whatever onto the exterior of the meat to create a bark as well. #3 - Butcher Wrap Paper - having a wax free thick butcher is essential to smoking the perfect brisket to contain all its juices from escaping. #2 - Bear Claws, the perfect tool to shred any meat off the smoker, a great tool to use for more than just shredding too! #1 - Instant Read Thermomotor, Every chef, cook and barbecuer needs one. You'll never have to struggle to see the temperature of your meat on a dial again!"
    },
    {
        "title": "Summer Grilling Guide 2021",
        "author": "Graham Vickers",
        "job": "CEO/ Lead Editor",
        "date": "July, 2, 2021, 11:30AM EST",
        "postMonth": "november",
        "profilePic": "headshot_circle.png",
        "img": "grill_guide.jpg",
        "post": "It's a hot summer, so you need to have even hotter and fresher dishes to serve to your friends and family this year! No more chips and dip! We only serve protein for snacks around my house! Today I'll be telling you the top 3 appetizers or snacks to make this summer on your smoker. Let's start with #3 - Beef tenderloin Sliders, experience mouth watering tender sliders smothered with a horseradish cream sauce. #2 - Pork Belly Burnt Ends, these have become a staple at my house when we have friends and family over, they're fun and easy to make and everyone is sure to love them! #1 Smoked Duck and Brie on toasted Baguette, a really flavorful dish that will surprise your guests and having them come back for more!"
    },
    {
        "title": "What Charcoal is Should You Buy?",
        "author": "Graham Vickers",
        "job": "CEO/ Lead Editor",
        "date": "September, 5, 2021, 4:30pM EST",
        "postMonth": "september",
        "profilePic": "headshot_circle.png",
        "show": "popular",
        "img": "charcoal.jpg",
        "post": "When you first start to cook with charcoal is can be confusing what products to cook with when there are so many out there. That's why you have me, I'm going to tell you what charcoal is the best on the mark and why, so here are my current top 3. #3 - Fogo Charcoal, Fogo has some of the biggest chunks of charcoal in bags on the market, but with such large pieces it can take longer to ignite. #2 - Big Green Egg Charcoal, a smooth soft smoke that gives off great flavour and the pieces are a great size to ignite in under 10 minutes! #1 - Royal Oak Charcoal, the most well rounded charcoal on the market today! I've been using the product the most with my BGE and I couldn't be happier using them, great flavour and smoke you really can't go wrong with!"
    }
]